init-v2.org
** 模块化配置
*** init.el 配置
init.el 保持最小配置，其他功能都拆分到独立文件。
加载 lisp directory path，在 init.el 里面添加:
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/init.el
  ;; -*- coding: utf-8; lexical-binding: t; -*-

  ;; open for debug error when you need.
  (setq debug-on-error t)

  (add-to-list 'load-path "~/.emacs.d/lisp/")
  (require 'custom)
  (require 'init-package)
  (require 'init-keybinding)
  (require 'init-defaults-better)
  (require 'init-company)
  (require 'init-vertico)
  (require 'init-orderless)
  (require 'init-marginalia)
  (require 'init-embark)
  (require 'init-awesome-tab)
  (require 'init-search)
  (require 'init-theme)
  (require 'init-org)
#+END_SRC
*** custom.el 用于配置 emacs 自动生成的 custom varables
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/lisp/custom.el
  ;; -*- lexical-binding: t -*-

  (setq custom-file (expand-file-name "~/.emacs.d/custom.el"))
  (load custom-file 'no-error 'no-message)
  (provide 'custom)

#+END_SRC

*** init-packages.el package 相关配置
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/lisp/init-package.el

  (require 'package)
  (setq package-archives '(("gnu"   . "https://mirrors.163.com/elpa/gnu/")

			   ("melpa" . "https://mirrors.163.com/elpa/melpa/")))
  (package-initialize)

  ;;防止反复调用 package-refresh-contents 会影响加载速度
  (when (not package-archive-contents)
    (package-refresh-contents))
  
  ;;添加本地目录插件
  (add-to-list 'load-path (expand-file-name "~/.emacs.d/site-lisp/awesome-tab") )


  (provide 'init-package)
#+END_SRC

*** init-keybinding.el

Emacs 常见符号的意义如下：
M(eta)：统一改到 option 键
s(uper)：统一改到 command 键
S(Shift)：不用修改
C(trl)：统一改成 Caps Lock

光标的移动在编辑器里面最为常见，必须熟练使用这些操作。
C-f 为前移一个字符， f 代表 forward。
C-b 为后移一个字符， b 代表 backward。
C-p 为上移至前一行， p 代表 previous。
C-n 为上移至下一行， n 代表 next。
C-a 为移至行首， a 代表 ahead。
C-e 为移至行尾， e 代表 end。

在整个Mac系统都内置了这些快捷键。在很多应用里也是。

把mac的几个常用操作配置到Emacs里面。

#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/lisp/init-keybinding.el
;; -*- lexical-binding: t -*-

  ;; mac option key ->  meta
  ;; mac commad key -> super
  (setq mac-option-modifier 'meta
	mac-command-modifier 'super)

  (global-set-key (kbd "s-a") 'mark-whole-buffer) ;;对应Windows上面的Ctrl-a 全选
  (global-set-key (kbd "s-c") 'kill-ring-save) ;;对应Windows上面的Ctrl-c 复制
  (global-set-key (kbd "s-s") 'save-buffer) ;; 对应Windows上面的Ctrl-s 保存
  (global-set-key (kbd "s-v") 'yank) ;对应Windows上面的Ctrl-v 粘贴
  (global-set-key (kbd "s-z") 'undo) ;对应Windows上面的Ctrol-z 撤销
  (global-set-key (kbd "s-x") 'kill-region) ;对应Windows上面的Ctrol-x 剪切

  (provide 'init-keybinding)

#+END_SRC
  
*** init-defaults-better.el
查看 emacs 的帮助可以：
C-h k 寻找快捷键的帮助信息
C-h v 寻找变量的帮助信息
C-h f 寻找函数的帮助信息
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/lisp/init-defaults-better.el
  ;; -*- lexical-binding: t -*-

  ;; emacs >= 26  开启行号可以这么设置
  (display-line-numbers-mode 1)

  ;; 关闭工具栏，tool-bar-mode 即为一个 Minor Mode
  (tool-bar-mode -1)
  ;; 关闭文件滑动控件
  (scroll-bar-mode -1)
  ;; 更改光标的样式
  (setq-default cursor-type 'bar)

  ;;不再需要，下面有更好的补全插件
  ;;(icomplete-mode 1)

  ;; 快速打开配置文件
  (defun open-init-file()
    (interactive)
    (find-file "~/.emacs.d/init.el"))
  ;; 这一行代码，将函数 open-init-file 绑定到 <f2> 键上
  (global-set-key (kbd "<f2>") 'open-init-file)

  ;; 更改显示字体大小 16pt
  ;; http://stackoverflow.com/questions/294664/how-to-set-the-font-size-in-emacs
  (set-face-attribute 'default nil :height 160);;

  ;;让鼠标滚动更好用
  (setq mouse-wheel-scroll-amount '(1 ((shift) . 1) ((control) . nil)))
  (setq mouse-wheel-progressive-speed nil)

  ;;括号匹配高亮
  (show-paren-mode t)
  ;;自动补全成对的符号
  (electric-pair-mode 1)


  ;;禁止自动生成备份文件
  (setq make-backup-files nil)

  ;;最近打开文件
  (require 'recentf)
  (recentf-mode 1)
  (setq recentf-max-menu-item 10)
  (global-set-key (kbd "C-x b") 'consult-buffer)

  (delete-selection-mode 1)

  ;;高亮当前行
  (global-hl-line-mode 1)



  (provide 'init-defaults-better)


#+END_SRC

*** init-company.el
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/lisp/init-company.el
  ;; -*- lexical-binding: t -*-

  (package-install 'company)
  (global-company-mode 1)

  ;; company mode 默认选择上一条和下一条候选项命令 M-n M-p
  (define-key company-active-map (kbd "C-n") 'company-select-next)
  (define-key company-active-map (kbd "C-p") 'company-select-previous)
  (provide 'init-company)

#+END_SRC
*** init-vertico.el
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/lisp/init-vertico.el
  ;; -*- lexical-binding: t -*-
  ;;增强 minibuffer 补全
  (package-install 'vertico)
  (vertico-mode t)

  (provide 'init-vertico)
#+END_SRC
*** init-orderless.el
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/lisp/init-orderless.el
  ;; -*- lexical-binding: t -*-
  ;;在 minibuffer 支持模糊搜索
  (package-install 'orderless)
  (setq completion-styles '(orderless))

  (provide 'init-orderless)
#+END_SRC
*** init-marginalia.el
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/lisp/init-marginalia.el
  ;; -*- lexical-binding: t -*-
  ;; 增强 minibuffer 的annotation
  (package-install 'marginalia)
  (marginalia-mode t)

  (provide 'init-marginalia)
#+END_SRC

*** init-embark.el
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/lisp/init-embark.el
  ;; -*- lexical-binding: t -*-

  ;; minibuffer action 就类似于在任何内容上右键点击
  (package-install 'embark)
  (global-set-key (kbd "C-;") 'embark-act)
  ;;利用这个 可以不用再记忆快捷键，只需要执行 C-x C-h 呼出帮助命令
  ;;然后输入想执行命令的关键字，既可以出现提示列表，又因为 orderless
  ;; 可以不用在意关键字单词的顺序 最后直接回车执行即可
  (setq prefix-help-command 'embark-prefix-help-command)

  (provide 'init-embark)
#+END_SRC
*** init-consult.el
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/lisp/init-consult.el
  ;; -*- lexical-binding: t -*-
  ;;增强文件内搜索和跳转函数定义
  (package-install 'consult)
  ;;同时使用需要这个
  (package-install 'embark-consult)
  ;;强大的文件内搜索功能，完全替代了 swiper 插件
  (global-set-key (kbd "C-s") 'consult-line)
  ;;文件内函数跳转
  ;;consult-imenu

  ;; consult 默认配置优化
  (eval-after-load 'consult
  (progn
    (setq
     consult-narrow-key "<"
     consult-line-numbers-widen t
     consult-async-min-input 2
     consult-async-refresh-delay  0.15
     consult-async-input-throttle 0.2
     consult-async-input-debounce 0.1)
    ))


#+END_SRC

使用 Emacs 打开文件管理器
M-x consult-directory-externally 然后输入文件目录，既可以用系统文件浏览器打开该目录
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/lisp/init-consult.el

  (defun consult-directory-externally (file)
    "Open FILE externally using the default application of the system."
    (interactive "fOpen externally: ")
    (if (and (eq system-type 'windows-nt)
	     (fboundp 'w32-shell-execute))
	(shell-command-to-string (encode-coding-string (replace-regexp-in-string "/" "\\\\"
										 (format "explorer.exe %s" (file-name-directory (expand-file-name file)))) 'gbk))
      (call-process (pcase system-type
		      ('darwin "open")
		      ('cygwin "cygstart")
		      (_ "xdg-open"))
		    nil 0 nil
		    (file-name-directory (expand-file-name file)))))
  ;; 给 embark 添加一个 action: E 使用系统的文件浏览器打开当前目录
  ;; https://github.com/oantolin/embark/tree/fcf068c0e912baa9267cbec02e56a5972d8f31b4#creating-your-own-keymaps
  (eval-after-load 'embark
    (defvar-keymap embark-file-map "E" #'consult-directory-externally))
  ;;打开当前文件的目录
  (defun my-open-current-directory ()
    (interactive)
    (consult-directory-externally default-directory))




  (provide 'init-consult)
#+END_SRC

*** init-awesome-tab.el
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/lisp/init-awesome-tab.el
  ;; -*- lexical-binding: t -*-
  (require 'awesome-tab)
  (awesome-tab-mode t)

  (defun awesome-tab-buffer-groups ()
    "`awesome-tab-buffer-groups' control buffers' group rules.

  Group awesome-tab with mode if buffer is derived from `eshell-mode' `emacs-lisp-mode' `dired-mode' `org-mode' `magit-mode'.
  All buffer name start with * will group to \"Emacs\".
  Other buffer group by `awesome-tab-get-group-name' with project name."
    (list
     (cond
      ((or (string-equal "*" (substring (buffer-name) 0 1))
	   (memq major-mode '(magit-process-mode
			      magit-status-mode
			      magit-diff-mode
			      magit-log-mode
			      magit-file-mode
			      magit-blob-mode
			      magit-blame-mode
			      )))
       "Emacs")
      ((derived-mode-p 'eshell-mode)
       "EShell")
      ((derived-mode-p 'emacs-lisp-mode)
       "Elisp")
      ((derived-mode-p 'dired-mode)
       "Dired")
      ((memq major-mode '(org-mode org-agenda-mode diary-mode))
       "OrgMode")
      (t
       (awesome-tab-get-group-name (current-buffer))))))


  (provide 'init-awesome-tab)
#+END_SRC

*** init-search.el
增强 consult 和 embark ，强大的文件夹内搜索大杀器
使用 consult-ripgrep 命令可以调用 ripgrep 搜索目标目录。

consult-ripgrep 可以搜索当前目录下所有文件内容，而且给出一个候选列表。
这时候按 C-c C-e 调用 embark-export-write 函数，将候选列表写入一下可写 buffer，
这时候再按 M-x query-replace-regexp 则可以交互式替换文本内容。 按 y 则执行替换，按 n 跳过
最后 C-x C-s 保存所有替换结果。
这个功能可以替换 ivy 插件。


#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/lisp/init-search.el

  (package-install 'embark-consult)
  (package-install 'wgrep)
  (setq wgrep-auto-save-buffer t)

  (eval-after-load
      'consult
    '(eval-after-load
	 'embark
       '(progn
	  (require 'embark-consult)
	  (add-hook
	   'embark-collect-mode-hook
	   #'consult-preview-at-point-mode))))

  (defun embark-export-write ()
  "Export the current vertico results to a writable buffer if possible.
  Supports exporting consult-grep to wgrep, file to wdeired, and consult-location to occur-edit"
  (interactive)
  (require 'embark)
  (require 'wgrep)
  (pcase-let ((`(,type . ,candidates)
	       (run-hook-with-args-until-success 'embark-candidate-collectors)))
    (pcase type
      ('consult-grep (let ((embark-after-export-hook #'wgrep-change-to-wgrep-mode))
		       (embark-export)))
      ('file (let ((embark-after-export-hook #'wdired-change-to-wdired-mode))
	       (embark-export)))
      ('consult-location (let ((embark-after-export-hook #'occur-edit-mode))
			   (embark-export)))
      (x (user-error "embark category %S doesn't support writable export" x)))))

  (define-key minibuffer-local-map (kbd "C-c C-e") 'embark-export-write)


  (provide 'init-search)
#+END_SRC	  

*** init-theme.el
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/lisp/init-theme.el
  ;; -*- lexical-binding: t -*-
  ;; install theme
  (package-install 'gruvbox-theme)
  (load-theme 'gruvbox-light-soft t)

  (provide 'init-theme)

#+END_SRC
*** init-org.el
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/lisp/init-org.el
  (require 'org-tempo)  ;开启easy template

  ;; 需要开启 electric-pair-mode
  ;; 禁用左尖括号
  (setq electric-pair-inhibit-predicate
	`(lambda (c)
	   (if (char-equal c ?\<) t (,electric-pair-inhibit-predicate c))))

  (add-hook 'org-mode-hook
	    (lambda ()
	      (setq-local electric-pair-inhibit-predicate
			  `(lambda (c)
			     (if (char-equal c ?\<) t (,electric-pair-inhibit-predicate c))))))

  (provide 'init-org)
#+END_SRC

